
/* 見ちゃいや～ん ﾎﾟｯ */

~{初期化}={System.ControllerShift(0); ResetGM();}

~{メジャー}={System.KeyFlag=(0,0,0,0,0,0,0);}			/* Major scale */
~{マイナー}={System.KeyFlag=(-1,-1,0,0,-1,0,0);}		/* Minor scale */
~{Ｈマイナー}={System.KeyFlag=(-1,0, 0,0,-1,0,0);}		/* Harmonic minor */
~{Ｍマイナー}={System.KeyFlag=(0,0,0,0,-1,0,0);}		/* Melodic minor */
~{アイオニアン}={System.KeyFlag=(0,0,0,0,0,0,0);}		/* Ionian */
~{ドリアン}={System.KeyFlag=(0,-1,0,0,-1,0,0);}			/* Dorian */
~{フリジアン}={System.KeyFlag=(-1,-1,0,-1,-1,0,0);}		/* Phrygian */
~{リディアン}={System.KeyFlag=(0,0,0,0,0,1,0);}			/* Lydian */
~{ミクソリディアン}={System.KeyFlag=(0,-1,0,0,0,0,0);}		/* Mixo-Lydian */
~{エオリアン}={System.KeyFlag=(-1,-1,0,0,-1,0,0);}		/* Aeolian */
~{ロクリアン}={System.KeyFlag=(-1,-1,0,-1,-1,0,-1);}		/* Locrian */
~{音程１}={System.KeyFlag=(0,0,0,0,0,0,0);}
~{音程２}={System.KeyFlag=(0,-1,0,0,-1,0,0);}
~{音程３}={System.KeyFlag=(-1,-1,0,-1,-1,0,0);}
~{音程４}={System.KeyFlag=(0,0,0,0,0,1,0);}
~{音程５}={System.KeyFlag=(0,-1,0,0,0,0,0);}
~{音程６}={System.KeyFlag=(-1,-1,0,0,-1,0,0);}
~{音程７}={System.KeyFlag=(-1,-1,0,-1,-1,0,-1);}
~{Ｃ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,64}
~{Ｃ＃調}={r-%4 y101,0 r%2 y100,2 r%2 y6,65}
~{Ｄ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,66}
~{Ｄ＃調}={r-%4 y101,0 r%2 y100,2 r%2 y6,67}
~{Ｅ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,68}
~{Ｆ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,69}
~{Ｆ＃調}={r-%4 y101,0 r%2 y100,2 r%2 y6,70}
~{Ｇ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,59}
~{Ｇ＃調}={r-%4 y101,0 r%2 y100,2 r%2 y6,60}
~{Ａ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,61}
~{Ａ＃調}={r-%4 y101,0 r%2 y100,2 r%2 y6,62}
~{Ｂ調}={r-%4 y101,0 r%2 y100,2 r%2 y6,63}
~{方向左}={P(0);}
~{方向左前}={P(32);}
~{方向前}={P(64);}
~{方向右前}={P(96);}
~{方向右}={P(127);}


