
~{主役１}={T1}
~{主役２}={T2}
~{主役３}={T3}
~{主役４}={T4}
~{主役５}={T5}
~{主役６}={T6}
~{主役７}={T7}
~{主役８}={T8}
~{主役９}={T9}
~{主役１０}={T10}
~{主役１１}={T11}
~{主役１２}={T12}
~{主役１３}={T13}
~{主役１４}={T14}
~{主役１５}={T15}
~{主役１６}={T16}

~{脇役１}={S1}
~{脇役２}={S2}
~{脇役３}={S3}
~{脇役４}={S4}
~{脇役５}={S5}
~{脇役６}={S6}
~{脇役７}={S7}
~{脇役８}={S8}
~{脇役９}={S9}
~{脇役１０}={S10}
~{脇役１１}={S11}
~{脇役１２}={S12}
~{脇役１３}={S13}

~{悪役１}={D1}
~{悪役２}={D2}
~{悪役３}={D3}
~{悪役４}={D4}
~{悪役５}={D5}
~{悪役６}={D6}
~{悪役７}={D7}
~{悪役８}={D8}
~{悪役９}={D9}
~{悪役１０}={D10}
~{悪役１１}={D11}
~{悪役１２}={D12}

~{暗い主役１}={Tm1}
~{暗い主役２}={Tm2}
~{暗い主役３}={Tm3}
~{暗い主役４}={Tm4}
~{暗い主役５}={Tm5}
~{暗い主役６}={Tm6}
~{暗い主役７}={Tm7}
~{暗い主役８}={Tm8}
~{暗い主役９}={Tm9}
~{暗い主役１０}={Tm10}
~{暗い主役１１}={Tm11}
~{暗い主役１２}={Tm12}

~{暗い脇役１}={Sm1}
~{暗い脇役２}={Sm2}
~{暗い脇役３}={Sm3}
~{暗い脇役４}={Sm4}
~{暗い脇役５}={Sm5}
~{暗い脇役６}={Sm6}
~{暗い脇役７}={Sm7}
~{暗い脇役８}={Sm8}
~{暗い脇役９}={Sm9}
~{暗い脇役１０}={Sm10}
~{暗い脇役１１}={Sm11}
~{暗い脇役１２}={Sm12}
~{暗い脇役１３}={Sm13}

~{暗い悪役１}={Dm1}
~{暗い悪役２}={Dm2}
~{暗い悪役３}={Dm3}
~{暗い悪役４}={Dm4}
~{暗い悪役５}={Dm5}
~{暗い悪役６}={Dm6}
~{暗い悪役７}={Dm7}
~{暗い悪役８}={Dm8}
~{暗い悪役９}={Dm9}
~{暗い悪役１０}={Dm10}
~{暗い悪役１１}={Dm11}
~{暗い悪役１２}={Dm12}
~{暗い悪役１３}={Dm13}
~{暗い悪役１４}={Dm14}
~{暗い悪役１５}={Dm15}

~{コンボ１}={Combo1}
~{コンボ２}={Combo2}
~{コンボ３}={Combo3}
~{コンボ４}={Combo4}
~{コンボ５}={Combo5}
~{コンボ６}={Combo6}
~{コンボ７}={Combo7}
~{コンボ８}={Combo8}
~{コンボ９}={Combo9}
~{コンボ１０}={Combo10}
~{コンボ１１}={Combo11}


~{Ｃ調}	={TimeKey(,,0)}
~{Ｃ＃調}	={TimeKey(,,1)}
~{Ｄ調}	={TimeKey(,,2)}
~{Ｄ＃調}	={TimeKey(,,3)}
~{Ｅ調}	={TimeKey(,,4)}
~{Ｆ調}	={TimeKey(,,5)}
~{Ｆ＃調}	={TimeKey(,,6)}
~{Ｇ調}	={TimeKey(,,-5)}
~{Ｇ＃調}	={TimeKey(,,-4)}
~{Ａ調}	={TimeKey(,,-3)}
~{Ａ＃調}	={TimeKey(,,-2)}
~{Ｂ調}	={TimeKey(,,-1)}

~{Ｄ♭調}	={TimeKey(,,1)}
~{Ｅ♭調}	={TimeKey(,,3)}
~{Ｇ♭調}	={TimeKey(,,6)}
~{Ａ♭調}	={TimeKey(,,-4)}
~{Ｂ♭調}	={TimeKey(,,-2)}

~{転調}={Trans}

~{フェイント}={Feint=1}

~{コード５オフ}={Chord5_off=1}
~{コード５オン}={Chord5_off=0}

~{ベースオフ}={RootBass=1}
~{ベースオン}={RootBass=0}

~{表示オフ}={Disp=0}
~{表示オン}={Disp=1}

~{高さ}={TopNote}

~{クローズ}={Open=0}
~{オープン１}={Open=1}
~{オープン２}={Open=2}

~{メジャー}={#Major}
~{マイナー}={#Minor}

~{音程１}={#Mode(0)}
~{音程２}={#Mode(1)}
~{音程３}={#Mode(2)}
~{音程４}={#Mode(3)}
~{音程５}={#Mode(4)}
~{音程６}={#Mode(5)}
~{音程７}={#Mode(6)}

~{音程８}={#HMinor(0)}
~{音程９}={#HMinor(1)}
~{音程１０}={#HMinor(2)}
~{音程１１}={#HMinor(3)}
~{音程１２}={#HMinor(4)}
~{音程１３}={#HMinor(5)}
~{音程１４}={#HMinor(6)}

~{音程１５}={#MMinor(0)}
~{音程１６}={#MMinor(1)}
~{音程１７}={#MMinor(2)}
~{音程１８}={#MMinor(3)}
~{音程１９}={#MMinor(4)}
~{音程２０}={#MMinor(5)}
~{音程２１}={#MMinor(6)}

~{明るい系１}={#Mode(0)}
~{明るい系２}={#Mode(3)}
~{明るい系３}={#Mode(4)}
~{明るい系４}={#HMinor(2)}
~{明るい系５}={#HMinor(4)}
~{明るい系６}={#HMinor(5)}
~{明るい系７}={#MMinor(2)}
~{明るい系８}={#MMinor(3)}
~{明るい系９}={#MMinor(4)}

~{暗い系１}={#Mode(5)}
~{暗い系２}={#Mode(1)}
~{暗い系３}={#Mode(2)}
~{暗い系４}={#Mode(6)}
~{暗い系５}={#HMinor(0)}
~{暗い系６}={#HMinor(1)}
~{暗い系７}={#HMinor(3)}
~{暗い系８}={#HMinor(6)}
~{暗い系９}={#MMinor(0)}
~{暗い系１０}={#MMinor(1)}
~{暗い系１１}={#MMinor(5)}
~{暗い系１２}={#MMinor(6)}

~{Ⅰ}={C_}
~{Ⅱ}={D_}
~{Ⅲ}={E_}
~{Ⅳ}={F_}
~{Ⅴ}={G_}
~{Ⅵ}={A_}
~{Ⅶ}={B_}

~{Ⅰ４}={C_4}
~{Ⅱ４}={D_4}
~{Ⅲ４}={E_4}
~{Ⅳ４}={F_4}
~{Ⅴ４}={G_4}
~{Ⅵ４}={A_4}
~{Ⅶ４}={B_4}

~{Ⅰ７}={C_7}
~{Ⅱ７}={D_7}
~{Ⅲ７}={E_7}
~{Ⅳ７}={F_7}
~{Ⅴ７}={G_7}
~{Ⅵ７}={A_7}
~{Ⅶ７}={B_7}

~{Ⅰ９}={C_9}
~{Ⅱ９}={D_9}
~{Ⅲ９}={E_9}
~{Ⅳ９}={F_9}
~{Ⅴ９}={G_9}
~{Ⅵ９}={A_9}
~{Ⅶ９}={B_9}




